import type { LegalContent } from './types.js'

/** Legal content for am. */
export const am: LegalContent = {
  'content.privacyPolicy': `
    <p><strong>በአጭሩ፦ በምንም መንገድ አንከታተልዎትም። መረጃዎን አናጋራም ወይም አንሸጥም። እርስዎ በፈቃደኝነት የሚሰጡንን የመገናኛ መረጃ ከእርስዎ ጋር ለመግባባት እና ስለ {{appName}} መረጃ ለማስተላለፍ እንጠቀማለን።</strong></p>
    <p>በ{{appName}} የጎብኝዎቻችንን ግላዊነት እናከብራለን። ይህ የግላዊነት ፖሊሲ ሰነድ በ{{appName}} የሚሰበሰብ እና የሚመዘገብ የመረጃ ዓይነቶችን እና እንዴት እንደምንጠቀምበት ይዟል።</p>
    <p>ተጨማሪ ጥያቄዎች ካሉዎት ወይም ስለ ግላዊነት ፖሊሲያችን ተጨማሪ መረጃ ከፈለጉ እባክዎን ያነጋግሩን።</p>
    <p>ይህ የግላዊነት ፖሊሲ በመስመር ላይ ለሚደረጉ እንቅስቃሴዎቻችን ብቻ ተፈጻሚ ይሆናል እና በ{{appName}} ውስጥ ያጋሩት እና/ወይም የሰበሰቡት መረጃ ለድር ጣቢያችን ጎብኝዎች ተፈጻሚ ነው። ይህ ፖሊሲ ከመስመር ውጪ ወይም ከዚህ ድር ጣቢያ ውጪ በሌሎች ሰርጦች ለተሰበሰበ ማንኛውም መረጃ ተፈጻሚ አይሆንም።</p>
    <h2>ፈቃድ</h2>
    <p>ድር ጣቢያችንን በመጠቀም በግላዊነት ፖሊሲያችን ይስማማሉ እና ውሎቹን ይቀበላሉ።</p>
    <h2>የምንሰበስበው መረጃ</h2>
    <p>የግል መረጃ መስጠት ሙሉ በሙሉ በፈቃደኝነት ላይ የተመሰረተ ነው። ሙሉ በሙሉ የእርስዎ ውሳኔ ነው።</p>
    <p>እንዲያቀርቡ የሚጠየቁት የግል መረጃ እና ለምን እንዲያቀርቡ እንደሚጠየቁ ምክንያቶቹ የግል መረጃዎን እንዲሰጡ በምንጠይቅበት ጊዜ ግልጽ ይሆንልዎታል።</p>
    <p>በቀጥታ ካነጋገሩን ስለ እርስዎ ተጨማሪ መረጃ ልንቀበል እንችላለን ለምሳሌ ስምዎ፣ ኢሜይል አድራሻዎ፣ ስልክ ቁጥርዎ፣ የመልእክቱ ይዘት እና/ወይም ሊልኩልን የሚችሉት አባሪዎች፣ እና ሌላ ማንኛውም ለመስጠት የመረጡት መረጃ።</p>
    <p>ለመለያ ሲመዘገቡ የመገናኛ መረጃዎን ልንጠይቅ እንችላለን፣ ስም፣ ኢሜይል አድራሻ፣ ስልክ ቁጥር፣ የድርጅት ስም እና አድራሻን ጨምሮ።</p>
    <h2>መረጃዎን እንዴት እንደምንጠቀም</h2>
    <p>የግል መረጃዎን ለመስጠት ከመረጡ ለሚከተሉት ጉዳዮች ሊውል ይችላል፦</p>
    <ul>
      <li>በመተግበሪያው ውስጥ ግላዊ ማበጀት</li>
      <li>ከእርስዎ ጋር መግባባት፣ ለደንበኛ አገልግሎት፣ ከድር ጣቢያው ጋር የተያያዙ ዝማኔዎችን እና ሌሎች መረጃዎችን ለማቅረብ፣ እና ለግብይት እና ለማስተዋወቂያ ዓላማዎች</li>
      <li>ኢሜይሎችን መላክ</li>
      <li>ማጭበርበርን መከላከል</li>
    </ul>
    <h2>የምዝግብ ማስታወሻ ፋይሎች</h2>
    <p>ኤፒአይው መደበኛ የምዝግብ ማስታወሻ ሂደቶችን ይከተላል። የሚመዘገበው መረጃ የበይነመረብ ፕሮቶኮል (IP) አድራሻዎች፣ የአሳሽ ዓይነቶች (ተጠቃሚ ወኪሎች)፣ የቀን እና ሰዓት ማህተሞች፣ እና የማጣቀሻ/መውጫ ገጾችን ያካትታል። እነዚህ ከማንኛውም በግል ሊለዩ ከሚችሉ መረጃዎች ጋር አይገናኙም። የመረጃው ዓላማ ለማረም፣ ለደህንነት እና ድር ጣቢያውን ለማስቀጠል ነው።</p>
    <h2>ኩኪዎች</h2>
    <p>መተግበሪያው ለኤፒአይ ለሚቀርቡ ጥያቄዎች ደህንነትዎን በመጠበቅ እንዲገቡ ለማቆየት አንድ የአሳሽ ኩኪ ይጠቀማል።</p>
    <p>የተጠቃሚ ባህሪን ለመከታተል ኩኪዎችን አንጠቀምም።</p>
    <p>ከሦስተኛ ወገን ምንም ኩኪዎችን ወይም ስክሪፕቶችን አንጠቀምም ወይም አንፈቅድም።</p>
    <h2>የGDPR የውሂብ ጥበቃ መብቶች</h2>
    <p>እያንዳንዱ ተጠቃሚ ለሚከተሉት መብቶች ባለመብት ነው፦</p>
    <p>የመዳረስ መብት – የግል ውሂብዎ ቅጂዎችን የመጠየቅ መብት አለዎት።</p>
    <p>የማስተካከል መብት – ትክክል ያልሆነ ብለው የሚያምኑትን ማንኛውንም መረጃ እንዲያስተካክሉ የመጠየቅ መብት አለዎት። ያልተሟላ ብለው የሚያምኑትን መረጃ እንዲያሟሉ የመጠየቅ መብትም አለዎት።</p>
    <p>የመሰረዝ መብት – የግል ውሂብዎን እንዲሰርዙ የመጠየቅ መብት አለዎት።</p>
    <p>ማቀናበርን የመገደብ መብት – የግል ውሂብዎን ማቀናበር እንዲገድቡ የመጠየቅ መብት አለዎት።</p>
    <p>ማቀናበርን የመቃወም መብት – የግል ውሂብዎን ማቀናበራችንን የመቃወም መብት አለዎት።</p>
    <p>የውሂብ ተንቀሳቃሽነት መብት – የሰበሰብነውን ውሂብ ወደ ሌላ ድርጅት ወይም በቀጥታ ወደ እርስዎ እንዲያስተላልፉ የመጠየቅ መብት አለዎት።</p>
    <p>ጥያቄ ካቀረቡ ለእርስዎ ምላሽ ለመስጠት አንድ ወር ጊዜ አለን። ከእነዚህ መብቶች ማንኛውንም ለመጠቀም ከፈለጉ እባክዎን ያነጋግሩን።</p>
    <h2>የልጆች መረጃ</h2>
    <p>{{appName}} ከ13 ዓመት በታች ከሆኑ ልጆች ማንኛውንም በግል ሊለዩ የሚችሉ መረጃዎችን ሆን ብሎ አይሰበስብም። ልጅዎ በድር ጣቢያችን ላይ ይህን ዓይነት መረጃ ሰጥቷል ብለው ካሰቡ ወዲያውኑ እንዲያነጋግሩን እናበረታታለን እና እንደዚህ ያለውን መረጃ ከመዝገቦቻችን በፍጥነት ለማስወገድ የተቻለንን ሁሉ እናደርጋለን።</p>`,
  'content.termsOfService': `
    <h2>1. ውሎች</h2>
    <p>ይህን ድር ጣቢያ በመጠቀም በእነዚህ የአገልግሎት ውሎች ለመገደድ ይስማማሉ እና ከማንኛውም ተፈጻሚ የአካባቢ ህጎች ጋር ለሚደረገው ስምምነት ተጠያቂ እንደሆኑ ይስማማሉ። ከእነዚህ ውሎች ማንኛውንም ካልተስማሙ ይህን ጣቢያ ከመጎብኘት ይከለከላሉ። በዚህ ድር ጣቢያ ውስጥ ያሉ ቁሳቁሶች በቅጂ መብት እና በንግድ ምልክት ህግ የተጠበቁ ናቸው።</p>
    <h2>2. የአጠቃቀም ፈቃድ</h2>
    <p>በዚህ ድር ጣቢያ ላይ ያሉ ቁሳቁሶችን አንድ ቅጂ ለግል፣ ለንግድ ያልሆነ ጊዜያዊ ማየት ብቻ በጊዜያዊነት ለማውረድ ፈቃድ ተሰጥቷል። ይህ የፈቃድ ስጦታ ነው፣ የባለቤትነት ማስተላለፍ አይደለም፣ እና በዚህ ፈቃድ መሰረት የሚከተሉትን ማድረግ አይችሉም፦</p>
    <ul>
      <li>ቁሳቁሶቹን ማሻሻል ወይም መቅዳት፤</li>
      <li>ቁሳቁሶቹን ለማንኛውም ንግድ ዓላማ ወይም ለማንኛውም ይፋ ማሳያ መጠቀም፤</li>
      <li>በዚህ ድር ጣቢያ ላይ ያለ ማንኛውንም ሶፍትዌር ለመገልበጥ መሞከር፤</li>
      <li>ከቁሳቁሶቹ ማንኛውንም የቅጂ መብት ወይም ሌሎች የባለቤትነት ማስታወሻዎችን ማስወገድ፤ ወይም</li>
      <li>ቁሳቁሶቹን ለሌላ ሰው ማስተላለፍ ወይም በሌላ ማንኛውም አገልጋይ ላይ ቁሳቁሶቹን "ማንጸባረቅ"።</li>
    </ul>
    <p>ይህ ከእነዚህ ገደቦች ማንኛቸውንም ጥሰት ላይ አገልግሎቶችን እንድናቆም ያስችለናል። ከተቋረጠ የማየት መብትዎም ይቋረጣል እና በእጅዎ ያሉ ማንኛውንም የወረዱ ቁሳቁሶችን በታተመም ይሁን በኤሌክትሮኒክ ቅርጸት ማጥፋት አለብዎት።</p>
    <h2>3. ከኃላፊነት ነፃ መሆን</h2>
    <p>በዚህ ድር ጣቢያ ላይ ያሉ ሁሉም ቁሳቁሶች "እንዳሉ" ይቀርባሉ። ምንም ዋስትናዎችን አንሰጥም፣ ግልጽ ይሁን ዝምተኛ፣ ስለዚህ ሌሎች ዋስትናዎችን ሁሉ እንከላከላለን። በተጨማሪም በዚህ ድር ጣቢያ ላይ ያሉ ቁሳቁሶችን ትክክለኛነት ወይም አስተማማኝነት ወይም ከእነዚህ ቁሳቁሶች ወይም ከዚህ ድር ጣቢያ ጋር የተገናኙ ማንኛውም ጣቢያዎችን በተመለከተ ምንም ዓይነት ውክልና አንሰጥም።</p>
    <h2>4. ገደቦች</h2>
    <p>እኛ ወይም አቅራቢዎቻችን በዚህ ድር ጣቢያ ላይ ያሉ ቁሳቁሶችን ከመጠቀም ወይም መጠቀም ካለመቻል ጋር ለሚነሱ ማንኛውም ጉዳቶች ተጠያቂ አንሆንም፣ የዚህ ድር ጣቢያ ስልጣን ያለው ተወካይ ስለዚህ ጉዳት ዕድል በቃል ወይም በጽሁፍ ቢነገርም።</p>
    <h2>5. ማሻሻያዎች እና ስህተቶች</h2>
    <p>በዚህ ድር ጣቢያ ላይ የሚታዩ ቁሳቁሶች ቴክኒካዊ፣ ፊደላዊ ወይም ፎቶግራፊያዊ ስህተቶችን ሊያካትቱ ይችላሉ። በዚህ ድር ጣቢያ ውስጥ ያሉ ቁሳቁሶች ትክክለኛ፣ የተሟሉ ወይም ወቅታዊ መሆናቸውን አንቀበልም። በዚህ ድር ጣቢያ ላይ ያሉ ቁሳቁሶችን በማንኛውም ጊዜ ያለ ማስታወቂያ ልንቀይር እንችላለን። ቁሳቁሶቹን ለማዘመን ምንም ግዴታ አንወስድም።</p>
    <h2>6. ማገናኛዎች</h2>
    <p>ከዚህ ድር ጣቢያ ጋር የተገናኙ ሁሉንም ጣቢያዎች አልገመገምንም እና ለማንኛውም እንደዚህ ዓይነት የተገናኘ ጣቢያ ይዘት ተጠያቂ አይደለንም። ማንኛውም ማገናኛ መኖር በእኛ በኩል ጣቢያውን ማጽደቅ ማለት አይደለም። ማንኛውንም የተገናኘ ድር ጣቢያ መጠቀም በተጠቃሚው ራሱ ሃላፊነት ነው።</p>
    <h2>7. የጣቢያ አገልግሎት ውሎች ማሻሻያዎች</h2>
    <p>ለዚህ ድር ጣቢያ እነዚህን የአገልግሎት ውሎች በማንኛውም ጊዜ ያለ ቅድመ ማስታወቂያ ልናሻሽል እንችላለን። ይህን ድር ጣቢያ በመጠቀም በእነዚህ የአገልግሎት ውሎች ወቅታዊ ስሪት ለመገደድ ይስማማሉ።</p>
    <h2>8. ግላዊነትዎ</h2>
    <p>እባክዎን የግላዊነት ፖሊሲያችንን ያንብቡ።</p>
    <h2>9. ተፈጻሚ ህግ</h2>
    <p>ከዚህ ድር ጣቢያ ጋር የተያያዘ ማንኛውም ይገባኛል ጥያቄ የህግ ግጭት ድንጋጌዎችን ሳይመለከት በተፈጻሚ ህጎች ይመራል።</p>`,
}
