import type { LegalContent } from './types.js'

/** Legal content for zh. */
export const zh: LegalContent = {
  'content.privacyPolicy': `
    <p><strong>简而言之：我们不会以任何方式追踪您。我们不会分享或出售您的信息。我们使用您选择性提供给我们的联系信息与您沟通并向您发送有关{{appName}}的信息。</strong></p>
    <p>在{{appName}}，我们重视访客的隐私。本隐私政策文件包含{{appName}}收集和记录的信息类型以及我们如何使用这些信息。</p>
    <p>如果您有其他问题或需要有关我们隐私政策的更多信息，请随时与我们联系。</p>
    <p>本隐私政策仅适用于我们的在线活动，并且对于我们网站的访客在{{appName}}中分享和/或收集的信息有效。本政策不适用于通过离线方式或本网站以外的其他渠道收集的任何信息。</p>
    <h2>同意</h2>
    <p>通过使用我们的网站，您在此同意我们的隐私政策并同意其条款。</p>
    <h2>我们收集的信息</h2>
    <p>提供个人信息完全是自愿的。这完全取决于您。</p>
    <p>您被要求提供的个人信息，以及要求您提供这些信息的原因，将在我们要求您提供个人信息时向您明确说明。</p>
    <p>如果您直接与我们联系，我们可能会收到有关您的其他信息，例如您的姓名、电子邮件地址、电话号码、消息内容和/或您可能发送给我们的附件，以及您可能选择提供的任何其他信息。</p>
    <p>当您注册账户时，我们可能会要求您提供联系信息，包括姓名、电子邮件地址、电话号码、公司名称和地址等项目。</p>
    <h2>我们如何使用您的信息</h2>
    <p>如果您选择提供您的个人信息，它可能用于以下目的：</p>
    <ul>
      <li>应用程序内的个性化</li>
      <li>与您沟通，包括客户服务、向您提供与网站相关的更新和其他信息，以及用于营销和推广目的</li>
      <li>向您发送电子邮件</li>
      <li>预防欺诈</li>
    </ul>
    <h2>日志文件</h2>
    <p>API遵循标准日志记录程序。记录的信息包括互联网协议（IP）地址、浏览器类型（用户代理）、日期和时间戳以及引荐/退出页面。这些信息不会与任何可识别个人身份的信息相关联。这些信息的目的是用于调试、安全和维持网站运行。</p>
    <h2>Cookie</h2>
    <p>该应用程序使用单个浏览器cookie来安全地保持您对API请求的登录状态。</p>
    <p>我们不使用cookie来追踪用户行为。</p>
    <p>我们不使用或允许任何来自第三方的cookie或脚本。</p>
    <h2>GDPR数据保护权利</h2>
    <p>每位用户都有以下权利：</p>
    <p>访问权 - 您有权要求获取您个人数据的副本。</p>
    <p>更正权 - 您有权要求我们更正您认为不准确的任何信息。您也有权要求我们完善您认为不完整的信息。</p>
    <p>删除权 - 您有权要求我们删除您的个人数据。</p>
    <p>限制处理权 - 您有权要求我们限制对您个人数据的处理。</p>
    <p>反对处理权 - 您有权反对我们处理您的个人数据。</p>
    <p>数据可携带权 - 您有权要求我们将我们收集的数据传输给另一个组织，或直接传输给您。</p>
    <p>如果您提出请求，我们有一个月的时间回复您。如果您想行使以上任何权利，请联系我们。</p>
    <h2>儿童信息</h2>
    <p>{{appName}}不会故意收集13岁以下儿童的任何个人身份信息。如果您认为您的孩子在我们的网站上提供了此类信息，我们强烈建议您立即与我们联系，我们将尽最大努力及时从我们的记录中删除此类信息。</p>`,
  'content.termsOfService': `
    <h2>1. 条款</h2>
    <p>通过使用本网站，您同意受这些服务条款的约束，并同意您有责任遵守任何适用的当地法律。如果您不同意其中任何条款，您将被禁止访问本网站。本网站中包含的材料受版权和商标法保护。</p>
    <h2>2. 使用许可</h2>
    <p>允许临时下载本网站上材料的一份副本，仅限个人、非商业性的临时浏览。这是许可的授予，而非所有权的转让，在此许可下您不得：</p>
    <ul>
      <li>修改或复制这些材料；</li>
      <li>将材料用于任何商业目的或任何公开展示；</li>
      <li>尝试对本网站上包含的任何软件进行逆向工程；</li>
      <li>从材料中删除任何版权或其他专有标注；或</li>
      <li>将材料转让给他人或在任何其他服务器上"镜像"这些材料。</li>
    </ul>
    <p>这将允许我们在违反任何这些限制时终止服务。终止后，您的浏览权也将被终止，您应销毁您持有的任何已下载材料，无论是印刷格式还是电子格式。</p>
    <h2>3. 免责声明</h2>
    <p>本网站上的所有材料均以"原样"提供。我们不作任何保证，无论是明示还是暗示，因此否认所有其他保证。此外，我们不对本网站上材料使用的准确性或可靠性，或与此类材料或与本网站链接的任何网站相关的内容作任何陈述。</p>
    <h2>4. 限制</h2>
    <p>即使本网站的授权代表已被口头或书面告知此类损害的可能性，我们或我们的供应商也不对因使用或无法使用本网站上的材料而产生的任何损害承担责任。</p>
    <h2>5. 修订和勘误</h2>
    <p>出现在本网站上的材料可能包含技术、排版或摄影错误。我们不承诺本网站中的任何材料是准确、完整或最新的。我们可能随时更改本网站上包含的材料，恕不另行通知。我们不承诺更新这些材料。</p>
    <h2>6. 链接</h2>
    <p>我们未审查与本网站链接的所有网站，且不对任何此类链接网站的内容负责。任何链接的存在并不意味着我们对该网站的认可。使用任何链接网站的风险由用户自行承担。</p>
    <h2>7. 网站服务条款修改</h2>
    <p>我们可以随时修改本网站的服务条款，无需事先通知。通过使用本网站，您同意受这些服务条款的当前版本的约束。</p>
    <h2>8. 您的隐私</h2>
    <p>请阅读我们的隐私政策。</p>
    <h2>9. 适用法律</h2>
    <p>与本网站相关的任何索赔应受适用法律管辖，不考虑法律冲突条款。</p>`,
}
